grevaillot/svd_tools/headers/ATSAM3X8H/usart3.h
#pragma once 

/* --- USART3: Universal Synchronous Asynchronous Receiver Transmitter 3  */

/** @defgroup usart3_registers Universal Synchronous Asynchronous Receiver Transmitter 3 Register
@{*/

/** USART3_CR Control Register **/
#define USART3_CR			MMIO32(USART3_BASE + 0x00)
/** USART3_CR_SPI_MODE Control Register **/
#define USART3_CR_SPI_MODE			MMIO32(USART3_BASE + 0x00)
/** USART3_MR Mode Register **/
#define USART3_MR			MMIO32(USART3_BASE + 0x04)
/** USART3_MR_SPI_MODE Mode Register **/
#define USART3_MR_SPI_MODE			MMIO32(USART3_BASE + 0x04)
/** USART3_IER Interrupt Enable Register **/
#define USART3_IER			MMIO32(USART3_BASE + 0x08)
/** USART3_IER_SPI_MODE Interrupt Enable Register **/
#define USART3_IER_SPI_MODE			MMIO32(USART3_BASE + 0x08)
/** USART3_IER_LIN_MODE Interrupt Enable Register **/
#define USART3_IER_LIN_MODE			MMIO32(USART3_BASE + 0x08)
/** USART3_IDR Interrupt Disable Register **/
#define USART3_IDR			MMIO32(USART3_BASE + 0x0c)
/** USART3_IDR_SPI_MODE Interrupt Disable Register **/
#define USART3_IDR_SPI_MODE			MMIO32(USART3_BASE + 0x0c)
/** USART3_IDR_LIN_MODE Interrupt Disable Register **/
#define USART3_IDR_LIN_MODE			MMIO32(USART3_BASE + 0x0c)
/** USART3_IMR Interrupt Mask Register **/
#define USART3_IMR			MMIO32(USART3_BASE + 0x10)
/** USART3_IMR_SPI_MODE Interrupt Mask Register **/
#define USART3_IMR_SPI_MODE			MMIO32(USART3_BASE + 0x10)
/** USART3_IMR_LIN_MODE Interrupt Mask Register **/
#define USART3_IMR_LIN_MODE			MMIO32(USART3_BASE + 0x10)
/** USART3_CSR Channel Status Register **/
#define USART3_CSR			MMIO32(USART3_BASE + 0x14)
/** USART3_CSR_SPI_MODE Channel Status Register **/
#define USART3_CSR_SPI_MODE			MMIO32(USART3_BASE + 0x14)
/** USART3_CSR_LIN_MODE Channel Status Register **/
#define USART3_CSR_LIN_MODE			MMIO32(USART3_BASE + 0x14)
/** USART3_RHR Receive Holding Register **/
#define USART3_RHR			MMIO32(USART3_BASE + 0x18)
/** USART3_THR Transmit Holding Register **/
#define USART3_THR			MMIO32(USART3_BASE + 0x1c)
/** USART3_BRGR Baud Rate Generator Register **/
#define USART3_BRGR			MMIO32(USART3_BASE + 0x20)
/** USART3_RTOR Receiver Time-out Register **/
#define USART3_RTOR			MMIO32(USART3_BASE + 0x24)
/** USART3_TTGR Transmitter Timeguard Register **/
#define USART3_TTGR			MMIO32(USART3_BASE + 0x28)
/** USART3_FIDI FI DI Ratio Register **/
#define USART3_FIDI			MMIO32(USART3_BASE + 0x40)
/** USART3_NER Number of Errors Register **/
#define USART3_NER			MMIO32(USART3_BASE + 0x44)
/** USART3_IF IrDA Filter Register **/
#define USART3_IF			MMIO32(USART3_BASE + 0x4c)
/** USART3_MAN Manchester Configuration Register **/
#define USART3_MAN			MMIO32(USART3_BASE + 0x50)
/** USART3_LINMR LIN Mode Register **/
#define USART3_LINMR			MMIO32(USART3_BASE + 0x54)
/** USART3_LINIR LIN Identifier Register **/
#define USART3_LINIR			MMIO32(USART3_BASE + 0x58)
/** USART3_LINBRR LIN Baud Rate Register **/
#define USART3_LINBRR			MMIO32(USART3_BASE + 0x5c)
/** USART3_WPMR Write Protection Mode Register **/
#define USART3_WPMR			MMIO32(USART3_BASE + 0xe4)
/** USART3_WPSR Write Protection Status Register **/
#define USART3_WPSR			MMIO32(USART3_BASE + 0xe8)
/** USART3_RPR Receive Pointer Register **/
#define USART3_RPR			MMIO32(USART3_BASE + 0x100)
/** USART3_RCR Receive Counter Register **/
#define USART3_RCR			MMIO32(USART3_BASE + 0x104)
/** USART3_TPR Transmit Pointer Register **/
#define USART3_TPR			MMIO32(USART3_BASE + 0x108)
/** USART3_TCR Transmit Counter Register **/
#define USART3_TCR			MMIO32(USART3_BASE + 0x10c)
/** USART3_RNPR Receive Next Pointer Register **/
#define USART3_RNPR			MMIO32(USART3_BASE + 0x110)
/** USART3_RNCR Receive Next Counter Register **/
#define USART3_RNCR			MMIO32(USART3_BASE + 0x114)
/** USART3_TNPR Transmit Next Pointer Register **/
#define USART3_TNPR			MMIO32(USART3_BASE + 0x118)
/** USART3_TNCR Transmit Next Counter Register **/
#define USART3_TNCR			MMIO32(USART3_BASE + 0x11c)
/** USART3_PTCR Transfer Control Register **/
#define USART3_PTCR			MMIO32(USART3_BASE + 0x120)
/** USART3_PTSR Transfer Status Register **/
#define USART3_PTSR			MMIO32(USART3_BASE + 0x124)

/**@}*/


/** @defgroup usart3_cr CR Control Register
@{*/

/** USART3_CR_LINWKUP Send LIN Wakeup Signal **/
#define USART3_CR_LINWKUP		(1 << 21)
/** USART3_CR_LINABT Abort LIN Transmission **/
#define USART3_CR_LINABT		(1 << 20)
/** USART3_CR_RTSDIS Request to Send Disable **/
#define USART3_CR_RTSDIS		(1 << 19)
/** USART3_CR_RTSEN Request to Send Enable **/
#define USART3_CR_RTSEN		(1 << 18)
/** USART3_CR_RETTO Rearm Time-out **/
#define USART3_CR_RETTO		(1 << 15)
/** USART3_CR_RSTNACK Reset Non Acknowledge **/
#define USART3_CR_RSTNACK		(1 << 14)
/** USART3_CR_RSTIT Reset Iterations **/
#define USART3_CR_RSTIT		(1 << 13)
/** USART3_CR_SENDA Send Address **/
#define USART3_CR_SENDA		(1 << 12)
/** USART3_CR_STTTO Start Time-out **/
#define USART3_CR_STTTO		(1 << 11)
/** USART3_CR_STPBRK Stop Break **/
#define USART3_CR_STPBRK		(1 << 10)
/** USART3_CR_STTBRK Start Break **/
#define USART3_CR_STTBRK		(1 << 9)
/** USART3_CR_RSTSTA Reset Status Bits **/
#define USART3_CR_RSTSTA		(1 << 8)
/** USART3_CR_TXDIS Transmitter Disable **/
#define USART3_CR_TXDIS		(1 << 7)
/** USART3_CR_TXEN Transmitter Enable **/
#define USART3_CR_TXEN		(1 << 6)
/** USART3_CR_RXDIS Receiver Disable **/
#define USART3_CR_RXDIS		(1 << 5)
/** USART3_CR_RXEN Receiver Enable **/
#define USART3_CR_RXEN		(1 << 4)
/** USART3_CR_RSTTX Reset Transmitter **/
#define USART3_CR_RSTTX		(1 << 3)
/** USART3_CR_RSTRX Reset Receiver **/
#define USART3_CR_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart3_cr_spi_mode CRSPIMODE Control Register
@{*/

/** USART3_CR_SPI_MODE_RCS Release SPI Chip Select **/
#define USART3_CR_SPI_MODE_RCS		(1 << 19)
/** USART3_CR_SPI_MODE_FCS Force SPI Chip Select **/
#define USART3_CR_SPI_MODE_FCS		(1 << 18)
/** USART3_CR_SPI_MODE_RSTSTA Reset Status Bits **/
#define USART3_CR_SPI_MODE_RSTSTA		(1 << 8)
/** USART3_CR_SPI_MODE_TXDIS Transmitter Disable **/
#define USART3_CR_SPI_MODE_TXDIS		(1 << 7)
/** USART3_CR_SPI_MODE_TXEN Transmitter Enable **/
#define USART3_CR_SPI_MODE_TXEN		(1 << 6)
/** USART3_CR_SPI_MODE_RXDIS Receiver Disable **/
#define USART3_CR_SPI_MODE_RXDIS		(1 << 5)
/** USART3_CR_SPI_MODE_RXEN Receiver Enable **/
#define USART3_CR_SPI_MODE_RXEN		(1 << 4)
/** USART3_CR_SPI_MODE_RSTTX Reset Transmitter **/
#define USART3_CR_SPI_MODE_RSTTX		(1 << 3)
/** USART3_CR_SPI_MODE_RSTRX Reset Receiver **/
#define USART3_CR_SPI_MODE_RSTRX		(1 << 2)

/**@}*/

/** @defgroup usart3_mr MR Mode Register
@{*/

/** USART3_MR_ONEBIT Start Frame Delimiter Selector **/
#define USART3_MR_ONEBIT		(1 << 31)
/** USART3_MR_MODSYNC Manchester Synchronization Mode **/
#define USART3_MR_MODSYNC		(1 << 30)
/** USART3_MR_MAN Manchester Encoder/Decoder Enable **/
#define USART3_MR_MAN		(1 << 29)
/** USART3_MR_FILTER Infrared Receive Line Filter **/
#define USART3_MR_FILTER		(1 << 28)

#define USART3_MR_MAX_ITERATION_SHIFT		24
#define USART3_MR_MAX_ITERATION_MASK		0x07
/** @defgroup usart3_mr_max_iteration MAXITERATION Maximum Number of Automatic Iteration
@{*/
/**@}*/

/** USART3_MR_INVDATA Inverted Data **/
#define USART3_MR_INVDATA		(1 << 23)
/** USART3_MR_VAR_SYNC Variable Synchronization of Command/Data Sync Start Frame Delimiter **/
#define USART3_MR_VAR_SYNC		(1 << 22)
/** USART3_MR_DSNACK Disable Successive NACK **/
#define USART3_MR_DSNACK		(1 << 21)
/** USART3_MR_INACK Inhibit Non Acknowledge **/
#define USART3_MR_INACK		(1 << 20)
/** USART3_MR_OVER Oversampling Mode **/
#define USART3_MR_OVER		(1 << 19)
/** USART3_MR_CLKO Clock Output Select **/
#define USART3_MR_CLKO		(1 << 18)
/** USART3_MR_MODE9 9-bit Character Length **/
#define USART3_MR_MODE9		(1 << 17)
/** USART3_MR_MSBF Bit Order **/
#define USART3_MR_MSBF		(1 << 16)

