grevaillot/svd_tools/headers/ATSAM3X8H/usart3.h
#define USART3_MR_CHMODE_SHIFT		14
#define USART3_MR_CHMODE_MASK		0x03
/** @defgroup usart3_mr_chmode CHMODE Channel Mode
@{*/
/**@}*/


#define USART3_MR_NBSTOP_SHIFT		12
#define USART3_MR_NBSTOP_MASK		0x03
/** @defgroup usart3_mr_nbstop NBSTOP Number of Stop Bits
@{*/
/**@}*/


#define USART3_MR_PAR_SHIFT		9
#define USART3_MR_PAR_MASK		0x07
/** @defgroup usart3_mr_par PAR Parity Type
@{*/
/**@}*/

/** USART3_MR_SYNC Synchronous Mode Select **/
#define USART3_MR_SYNC		(1 << 8)

#define USART3_MR_CHRL_SHIFT		6
#define USART3_MR_CHRL_MASK		0x03
/** @defgroup usart3_mr_chrl CHRL Character Length
@{*/
/**@}*/


#define USART3_MR_USCLKS_SHIFT		4
#define USART3_MR_USCLKS_MASK		0x03
/** @defgroup usart3_mr_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART3_MR_USART_MODE_SHIFT		0
#define USART3_MR_USART_MODE_MASK		0x0f
/** @defgroup usart3_mr_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_mr_spi_mode MRSPIMODE Mode Register
@{*/

/** USART3_MR_SPI_MODE_WRDBT Wait Read Data Before Transfer **/
#define USART3_MR_SPI_MODE_WRDBT		(1 << 20)
/** USART3_MR_SPI_MODE_CPOL SPI Clock Polarity **/
#define USART3_MR_SPI_MODE_CPOL		(1 << 16)
/** USART3_MR_SPI_MODE_CPHA SPI Clock Phase **/
#define USART3_MR_SPI_MODE_CPHA		(1 << 8)

#define USART3_MR_SPI_MODE_CHRL_SHIFT		6
#define USART3_MR_SPI_MODE_CHRL_MASK		0x03
/** @defgroup usart3_mr_spi_mode_chrl CHRL Character Length
@{*/
/**@}*/


#define USART3_MR_SPI_MODE_USCLKS_SHIFT		4
#define USART3_MR_SPI_MODE_USCLKS_MASK		0x03
/** @defgroup usart3_mr_spi_mode_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART3_MR_SPI_MODE_USART_MODE_SHIFT		0
#define USART3_MR_SPI_MODE_USART_MODE_MASK		0x0f
/** @defgroup usart3_mr_spi_mode_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_ier IER Interrupt Enable Register
@{*/

/** USART3_IER_MANE Manchester Error Interrupt Enable **/
#define USART3_IER_MANE		(1 << 24)
/** USART3_IER_CTSIC Clear to Send Input Change Interrupt Enable **/
#define USART3_IER_CTSIC		(1 << 19)
/** USART3_IER_NACK Non Acknowledge Interrupt Enable **/
#define USART3_IER_NACK		(1 << 13)
/** USART3_IER_RXBUFF Buffer Full Interrupt Enable (available in all USART modes of operation) **/
#define USART3_IER_RXBUFF		(1 << 12)
/** USART3_IER_TXBUFE Buffer Empty Interrupt Enable (available in all USART modes of operation) **/
#define USART3_IER_TXBUFE		(1 << 11)
/** USART3_IER_ITER Max number of Repetitions Reached Interrupt Enable **/
#define USART3_IER_ITER		(1 << 10)
/** USART3_IER_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART3_IER_TXEMPTY		(1 << 9)
/** USART3_IER_TIMEOUT Time-out Interrupt Enable **/
#define USART3_IER_TIMEOUT		(1 << 8)
/** USART3_IER_PARE Parity Error Interrupt Enable **/
#define USART3_IER_PARE		(1 << 7)
/** USART3_IER_FRAME Framing Error Interrupt Enable **/
#define USART3_IER_FRAME		(1 << 6)
/** USART3_IER_OVRE Overrun Error Interrupt Enable **/
#define USART3_IER_OVRE		(1 << 5)
/** USART3_IER_ENDTX End of Transmit Interrupt Enable (available in all USART modes of operation) **/
#define USART3_IER_ENDTX		(1 << 4)
/** USART3_IER_ENDRX End of Receive Transfer Interrupt Enable (available in all USART modes of operation) **/
#define USART3_IER_ENDRX		(1 << 3)
/** USART3_IER_RXBRK Receiver Break Interrupt Enable **/
#define USART3_IER_RXBRK		(1 << 2)
/** USART3_IER_TXRDY TXRDY Interrupt Enable **/
#define USART3_IER_TXRDY		(1 << 1)
/** USART3_IER_RXRDY RXRDY Interrupt Enable **/
#define USART3_IER_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart3_ier_spi_mode IERSPIMODE Interrupt Enable Register
@{*/

/** USART3_IER_SPI_MODE_RXBUFF  **/
#define USART3_IER_SPI_MODE_RXBUFF		(1 << 12)
/** USART3_IER_SPI_MODE_TXBUFE  **/
#define USART3_IER_SPI_MODE_TXBUFE		(1 << 11)
/** USART3_IER_SPI_MODE_UNRE SPI Underrun Error Interrupt Enable **/
#define USART3_IER_SPI_MODE_UNRE		(1 << 10)
/** USART3_IER_SPI_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART3_IER_SPI_MODE_TXEMPTY		(1 << 9)
/** USART3_IER_SPI_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART3_IER_SPI_MODE_OVRE		(1 << 5)
/** USART3_IER_SPI_MODE_ENDTX  **/
#define USART3_IER_SPI_MODE_ENDTX		(1 << 4)
/** USART3_IER_SPI_MODE_ENDRX  **/
#define USART3_IER_SPI_MODE_ENDRX		(1 << 3)
/** USART3_IER_SPI_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART3_IER_SPI_MODE_TXRDY		(1 << 1)
/** USART3_IER_SPI_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART3_IER_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart3_ier_lin_mode IERLINMODE Interrupt Enable Register
@{*/

/** USART3_IER_LIN_MODE_LINSNRE LIN Slave Not Responding Error Interrupt Enable **/
#define USART3_IER_LIN_MODE_LINSNRE		(1 << 29)
/** USART3_IER_LIN_MODE_LINCE LIN Checksum Error Interrupt Enable **/
#define USART3_IER_LIN_MODE_LINCE		(1 << 28)
/** USART3_IER_LIN_MODE_LINIPE LIN Identifier Parity Interrupt Enable **/
#define USART3_IER_LIN_MODE_LINIPE		(1 << 27)
/** USART3_IER_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error Interrupt Enable **/
#define USART3_IER_LIN_MODE_LINISFE		(1 << 26)
/** USART3_IER_LIN_MODE_LINBE LIN Bus Error Interrupt Enable **/
#define USART3_IER_LIN_MODE_LINBE		(1 << 25)
/** USART3_IER_LIN_MODE_LINTC LIN Transfer Completed Interrupt Enable **/
#define USART3_IER_LIN_MODE_LINTC		(1 << 15)
/** USART3_IER_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received Interrupt Enable **/
#define USART3_IER_LIN_MODE_LINID		(1 << 14)
/** USART3_IER_LIN_MODE_LINBK LIN Break Sent or LIN Break Received Interrupt Enable **/
#define USART3_IER_LIN_MODE_LINBK		(1 << 13)
/** USART3_IER_LIN_MODE_RXBUFF  **/
#define USART3_IER_LIN_MODE_RXBUFF		(1 << 12)
/** USART3_IER_LIN_MODE_TXBUFE  **/
#define USART3_IER_LIN_MODE_TXBUFE		(1 << 11)
/** USART3_IER_LIN_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART3_IER_LIN_MODE_TXEMPTY		(1 << 9)
/** USART3_IER_LIN_MODE_TIMEOUT Time-out Interrupt Enable **/
#define USART3_IER_LIN_MODE_TIMEOUT		(1 << 8)
/** USART3_IER_LIN_MODE_PARE Parity Error Interrupt Enable **/
#define USART3_IER_LIN_MODE_PARE		(1 << 7)
/** USART3_IER_LIN_MODE_FRAME Framing Error Interrupt Enable **/
#define USART3_IER_LIN_MODE_FRAME		(1 << 6)
/** USART3_IER_LIN_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART3_IER_LIN_MODE_OVRE		(1 << 5)
/** USART3_IER_LIN_MODE_ENDTX  **/
#define USART3_IER_LIN_MODE_ENDTX		(1 << 4)
/** USART3_IER_LIN_MODE_ENDRX  **/
#define USART3_IER_LIN_MODE_ENDRX		(1 << 3)
/** USART3_IER_LIN_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART3_IER_LIN_MODE_TXRDY		(1 << 1)
/** USART3_IER_LIN_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART3_IER_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart3_idr IDR Interrupt Disable Register
@{*/

