grevaillot/svd_tools/headers/ATSAM3X8H/usart3.h
/** @defgroup usart3_imr_spi_mode IMRSPIMODE Interrupt Mask Register
@{*/

/** USART3_IMR_SPI_MODE_RXBUFF  **/
#define USART3_IMR_SPI_MODE_RXBUFF		(1 << 12)
/** USART3_IMR_SPI_MODE_TXBUFE  **/
#define USART3_IMR_SPI_MODE_TXBUFE		(1 << 11)
/** USART3_IMR_SPI_MODE_UNRE SPI Underrun Error Interrupt Mask **/
#define USART3_IMR_SPI_MODE_UNRE		(1 << 10)
/** USART3_IMR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART3_IMR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART3_IMR_SPI_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART3_IMR_SPI_MODE_OVRE		(1 << 5)
/** USART3_IMR_SPI_MODE_ENDTX  **/
#define USART3_IMR_SPI_MODE_ENDTX		(1 << 4)
/** USART3_IMR_SPI_MODE_ENDRX  **/
#define USART3_IMR_SPI_MODE_ENDRX		(1 << 3)
/** USART3_IMR_SPI_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART3_IMR_SPI_MODE_TXRDY		(1 << 1)
/** USART3_IMR_SPI_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART3_IMR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart3_imr_lin_mode IMRLINMODE Interrupt Mask Register
@{*/

/** USART3_IMR_LIN_MODE_LINSNRE LIN Slave Not Responding Error Interrupt Mask **/
#define USART3_IMR_LIN_MODE_LINSNRE		(1 << 29)
/** USART3_IMR_LIN_MODE_LINCE LIN Checksum Error Interrupt Mask **/
#define USART3_IMR_LIN_MODE_LINCE		(1 << 28)
/** USART3_IMR_LIN_MODE_LINIPE LIN Identifier Parity Interrupt Mask **/
#define USART3_IMR_LIN_MODE_LINIPE		(1 << 27)
/** USART3_IMR_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error Interrupt Mask **/
#define USART3_IMR_LIN_MODE_LINISFE		(1 << 26)
/** USART3_IMR_LIN_MODE_LINBE LIN Bus Error Interrupt Mask **/
#define USART3_IMR_LIN_MODE_LINBE		(1 << 25)
/** USART3_IMR_LIN_MODE_LINTC LIN Transfer Completed Interrupt Mask **/
#define USART3_IMR_LIN_MODE_LINTC		(1 << 15)
/** USART3_IMR_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received Interrupt Mask **/
#define USART3_IMR_LIN_MODE_LINID		(1 << 14)
/** USART3_IMR_LIN_MODE_LINBK LIN Break Sent or LIN Break Received Interrupt Mask **/
#define USART3_IMR_LIN_MODE_LINBK		(1 << 13)
/** USART3_IMR_LIN_MODE_RXBUFF  **/
#define USART3_IMR_LIN_MODE_RXBUFF		(1 << 12)
/** USART3_IMR_LIN_MODE_TXBUFE  **/
#define USART3_IMR_LIN_MODE_TXBUFE		(1 << 11)
/** USART3_IMR_LIN_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART3_IMR_LIN_MODE_TXEMPTY		(1 << 9)
/** USART3_IMR_LIN_MODE_TIMEOUT Time-out Interrupt Mask **/
#define USART3_IMR_LIN_MODE_TIMEOUT		(1 << 8)
/** USART3_IMR_LIN_MODE_PARE Parity Error Interrupt Mask **/
#define USART3_IMR_LIN_MODE_PARE		(1 << 7)
/** USART3_IMR_LIN_MODE_FRAME Framing Error Interrupt Mask **/
#define USART3_IMR_LIN_MODE_FRAME		(1 << 6)
/** USART3_IMR_LIN_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART3_IMR_LIN_MODE_OVRE		(1 << 5)
/** USART3_IMR_LIN_MODE_ENDTX  **/
#define USART3_IMR_LIN_MODE_ENDTX		(1 << 4)
/** USART3_IMR_LIN_MODE_ENDRX  **/
#define USART3_IMR_LIN_MODE_ENDRX		(1 << 3)
/** USART3_IMR_LIN_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART3_IMR_LIN_MODE_TXRDY		(1 << 1)
/** USART3_IMR_LIN_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART3_IMR_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart3_csr CSR Channel Status Register
@{*/

/** USART3_CSR_MANERR Manchester Error **/
#define USART3_CSR_MANERR		(1 << 24)
/** USART3_CSR_CTS Image of CTS Input **/
#define USART3_CSR_CTS		(1 << 23)
/** USART3_CSR_CTSIC Clear to Send Input Change Flag **/
#define USART3_CSR_CTSIC		(1 << 19)
/** USART3_CSR_NACK Non Acknowledge Interrupt **/
#define USART3_CSR_NACK		(1 << 13)
/** USART3_CSR_RXBUFF Reception Buffer Full **/
#define USART3_CSR_RXBUFF		(1 << 12)
/** USART3_CSR_TXBUFE Transmission Buffer Empty **/
#define USART3_CSR_TXBUFE		(1 << 11)
/** USART3_CSR_ITER Max Number of Repetitions Reached **/
#define USART3_CSR_ITER		(1 << 10)
/** USART3_CSR_TXEMPTY Transmitter Empty **/
#define USART3_CSR_TXEMPTY		(1 << 9)
/** USART3_CSR_TIMEOUT Receiver Time-out **/
#define USART3_CSR_TIMEOUT		(1 << 8)
/** USART3_CSR_PARE Parity Error **/
#define USART3_CSR_PARE		(1 << 7)
/** USART3_CSR_FRAME Framing Error **/
#define USART3_CSR_FRAME		(1 << 6)
/** USART3_CSR_OVRE Overrun Error **/
#define USART3_CSR_OVRE		(1 << 5)
/** USART3_CSR_ENDTX End of Transmitter Transfer **/
#define USART3_CSR_ENDTX		(1 << 4)
/** USART3_CSR_ENDRX End of Receiver Transfer **/
#define USART3_CSR_ENDRX		(1 << 3)
/** USART3_CSR_RXBRK Break Received/End of Break **/
#define USART3_CSR_RXBRK		(1 << 2)
/** USART3_CSR_TXRDY Transmitter Ready **/
#define USART3_CSR_TXRDY		(1 << 1)
/** USART3_CSR_RXRDY Receiver Ready **/
#define USART3_CSR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart3_csr_spi_mode CSRSPIMODE Channel Status Register
@{*/

/** USART3_CSR_SPI_MODE_RXBUFF  **/
#define USART3_CSR_SPI_MODE_RXBUFF		(1 << 12)
/** USART3_CSR_SPI_MODE_TXBUFE  **/
#define USART3_CSR_SPI_MODE_TXBUFE		(1 << 11)
/** USART3_CSR_SPI_MODE_UNRE Underrun Error **/
#define USART3_CSR_SPI_MODE_UNRE		(1 << 10)
/** USART3_CSR_SPI_MODE_TXEMPTY Transmitter Empty **/
#define USART3_CSR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART3_CSR_SPI_MODE_OVRE Overrun Error **/
#define USART3_CSR_SPI_MODE_OVRE		(1 << 5)
/** USART3_CSR_SPI_MODE_ENDTX  **/
#define USART3_CSR_SPI_MODE_ENDTX		(1 << 4)
/** USART3_CSR_SPI_MODE_ENDRX  **/
#define USART3_CSR_SPI_MODE_ENDRX		(1 << 3)
/** USART3_CSR_SPI_MODE_TXRDY Transmitter Ready **/
#define USART3_CSR_SPI_MODE_TXRDY		(1 << 1)
/** USART3_CSR_SPI_MODE_RXRDY Receiver Ready **/
#define USART3_CSR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart3_csr_lin_mode CSRLINMODE Channel Status Register
@{*/

/** USART3_CSR_LIN_MODE_LINSNRE LIN Slave Not Responding Error **/
#define USART3_CSR_LIN_MODE_LINSNRE		(1 << 29)
/** USART3_CSR_LIN_MODE_LINCE LIN Checksum Error **/
#define USART3_CSR_LIN_MODE_LINCE		(1 << 28)
/** USART3_CSR_LIN_MODE_LINIPE LIN Identifier Parity Error **/
#define USART3_CSR_LIN_MODE_LINIPE		(1 << 27)
/** USART3_CSR_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error **/
#define USART3_CSR_LIN_MODE_LINISFE		(1 << 26)
/** USART3_CSR_LIN_MODE_LINBE LIN Bit Error **/
#define USART3_CSR_LIN_MODE_LINBE		(1 << 25)
/** USART3_CSR_LIN_MODE_LINBLS LIN Bus Line Status **/
#define USART3_CSR_LIN_MODE_LINBLS		(1 << 23)
/** USART3_CSR_LIN_MODE_LINTC LIN Transfer Completed **/
#define USART3_CSR_LIN_MODE_LINTC		(1 << 15)
/** USART3_CSR_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received **/
#define USART3_CSR_LIN_MODE_LINID		(1 << 14)
/** USART3_CSR_LIN_MODE_LINBK LIN Break Sent or LIN Break Received **/
#define USART3_CSR_LIN_MODE_LINBK		(1 << 13)
/** USART3_CSR_LIN_MODE_RXBUFF  **/
#define USART3_CSR_LIN_MODE_RXBUFF		(1 << 12)
/** USART3_CSR_LIN_MODE_TXBUFE  **/
#define USART3_CSR_LIN_MODE_TXBUFE		(1 << 11)
/** USART3_CSR_LIN_MODE_TXEMPTY Transmitter Empty **/
#define USART3_CSR_LIN_MODE_TXEMPTY		(1 << 9)
/** USART3_CSR_LIN_MODE_TIMEOUT Receiver Time-out **/
#define USART3_CSR_LIN_MODE_TIMEOUT		(1 << 8)
/** USART3_CSR_LIN_MODE_PARE Parity Error **/
#define USART3_CSR_LIN_MODE_PARE		(1 << 7)
/** USART3_CSR_LIN_MODE_FRAME Framing Error **/
#define USART3_CSR_LIN_MODE_FRAME		(1 << 6)
/** USART3_CSR_LIN_MODE_OVRE Overrun Error **/
#define USART3_CSR_LIN_MODE_OVRE		(1 << 5)
/** USART3_CSR_LIN_MODE_ENDTX  **/
#define USART3_CSR_LIN_MODE_ENDTX		(1 << 4)
/** USART3_CSR_LIN_MODE_ENDRX  **/
#define USART3_CSR_LIN_MODE_ENDRX		(1 << 3)
/** USART3_CSR_LIN_MODE_TXRDY Transmitter Ready **/
#define USART3_CSR_LIN_MODE_TXRDY		(1 << 1)
/** USART3_CSR_LIN_MODE_RXRDY Receiver Ready **/
#define USART3_CSR_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart3_rhr RHR Receive Holding Register
@{*/

/** USART3_RHR_RXSYNH Received Sync **/
#define USART3_RHR_RXSYNH		(1 << 15)

#define USART3_RHR_RXCHR_SHIFT		0
#define USART3_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart3_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

