grevaillot/svd_tools/headers/ATSAM3X8H/usart3.h
/** @defgroup usart3_thr THR Transmit Holding Register
@{*/

/** USART3_THR_TXSYNH Sync Field to be Transmitted **/
#define USART3_THR_TXSYNH		(1 << 15)

#define USART3_THR_TXCHR_SHIFT		0
#define USART3_THR_TXCHR_MASK		0x1ff
/** @defgroup usart3_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_brgr BRGR Baud Rate Generator Register
@{*/


#define USART3_BRGR_FP_SHIFT		16
#define USART3_BRGR_FP_MASK		0x07
/** @defgroup usart3_brgr_fp FP Fractional Part
@{*/
/**@}*/


#define USART3_BRGR_CD_SHIFT		0
#define USART3_BRGR_CD_MASK		0xffff
/** @defgroup usart3_brgr_cd CD Clock Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_rtor RTOR Receiver Time-out Register
@{*/


#define USART3_RTOR_TO_SHIFT		0
#define USART3_RTOR_TO_MASK		0x1ffff
/** @defgroup usart3_rtor_to TO Time-out Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_ttgr TTGR Transmitter Timeguard Register
@{*/


#define USART3_TTGR_TG_SHIFT		0
#define USART3_TTGR_TG_MASK		0xff
/** @defgroup usart3_ttgr_tg TG Timeguard Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_fidi FIDI FI DI Ratio Register
@{*/


#define USART3_FIDI_FI_DI_RATIO_SHIFT		0
#define USART3_FIDI_FI_DI_RATIO_MASK		0x7ff
/** @defgroup usart3_fidi_fi_di_ratio FIDIRATIO FI Over DI Ratio Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_ner NER Number of Errors Register
@{*/


#define USART3_NER_NB_ERRORS_SHIFT		0
#define USART3_NER_NB_ERRORS_MASK		0xff
/** @defgroup usart3_ner_nb_errors NBERRORS Number of Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_if IF IrDA Filter Register
@{*/


#define USART3_IF_IRDA_FILTER_SHIFT		0
#define USART3_IF_IRDA_FILTER_MASK		0xff
/** @defgroup usart3_if_irda_filter IRDAFILTER IrDA Filter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_man MAN Manchester Configuration Register
@{*/

/** USART3_MAN_DRIFT Drift Compensation **/
#define USART3_MAN_DRIFT		(1 << 30)
/** USART3_MAN_ONE Must Be Set to 1 **/
#define USART3_MAN_ONE		(1 << 29)
/** USART3_MAN_RX_MPOL Receiver Manchester Polarity **/
#define USART3_MAN_RX_MPOL		(1 << 28)

#define USART3_MAN_RX_PP_SHIFT		24
#define USART3_MAN_RX_PP_MASK		0x03
/** @defgroup usart3_man_rx_pp RXPP Receiver Preamble Pattern detected
@{*/
/**@}*/


#define USART3_MAN_RX_PL_SHIFT		16
#define USART3_MAN_RX_PL_MASK		0x0f
/** @defgroup usart3_man_rx_pl RXPL Receiver Preamble Length
@{*/
/**@}*/

/** USART3_MAN_TX_MPOL Transmitter Manchester Polarity **/
#define USART3_MAN_TX_MPOL		(1 << 12)

#define USART3_MAN_TX_PP_SHIFT		8
#define USART3_MAN_TX_PP_MASK		0x03
/** @defgroup usart3_man_tx_pp TXPP Transmitter Preamble Pattern
@{*/
/**@}*/


#define USART3_MAN_TX_PL_SHIFT		0
#define USART3_MAN_TX_PL_MASK		0x0f
/** @defgroup usart3_man_tx_pl TXPL Transmitter Preamble Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_linmr LINMR LIN Mode Register
@{*/

/** USART3_LINMR_PDCM PDC Mode **/
#define USART3_LINMR_PDCM		(1 << 16)

#define USART3_LINMR_DLC_SHIFT		8
#define USART3_LINMR_DLC_MASK		0xff
/** @defgroup usart3_linmr_dlc DLC Data Length Control
@{*/
/**@}*/

/** USART3_LINMR_WKUPTYP Wakeup Signal Type **/
#define USART3_LINMR_WKUPTYP		(1 << 7)
/** USART3_LINMR_FSDIS Frame Slot Mode Disable **/
#define USART3_LINMR_FSDIS		(1 << 6)
/** USART3_LINMR_DLM Data Length Mode **/
#define USART3_LINMR_DLM		(1 << 5)
/** USART3_LINMR_CHKTYP Checksum Type **/
#define USART3_LINMR_CHKTYP		(1 << 4)
/** USART3_LINMR_CHKDIS Checksum Disable **/
#define USART3_LINMR_CHKDIS		(1 << 3)
/** USART3_LINMR_PARDIS Parity Disable **/
#define USART3_LINMR_PARDIS		(1 << 2)

#define USART3_LINMR_NACT_SHIFT		0
#define USART3_LINMR_NACT_MASK		0x03
/** @defgroup usart3_linmr_nact NACT LIN Node Action
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_linir LINIR LIN Identifier Register
@{*/


#define USART3_LINIR_IDCHR_SHIFT		0
#define USART3_LINIR_IDCHR_MASK		0xff
/** @defgroup usart3_linir_idchr IDCHR Identifier Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_linbrr LINBRR LIN Baud Rate Register
@{*/


#define USART3_LINBRR_LINFP_SHIFT		16
#define USART3_LINBRR_LINFP_MASK		0x07
/** @defgroup usart3_linbrr_linfp LINFP Fractional Part after Synchronization
@{*/
/**@}*/


#define USART3_LINBRR_LINCD_SHIFT		0
#define USART3_LINBRR_LINCD_MASK		0xffff
/** @defgroup usart3_linbrr_lincd LINCD Clock Divider after Synchronization
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_wpmr WPMR Write Protection Mode Register
@{*/


#define USART3_WPMR_WPKEY_SHIFT		8
#define USART3_WPMR_WPKEY_MASK		0xffffff
/** @defgroup usart3_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** USART3_WPMR_WPEN Write Protection Enable **/
#define USART3_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup usart3_wpsr WPSR Write Protection Status Register
@{*/


#define USART3_WPSR_WPVSRC_SHIFT		8
#define USART3_WPSR_WPVSRC_MASK		0xffff
/** @defgroup usart3_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** USART3_WPSR_WPVS Write Protection Violation Status **/
#define USART3_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup usart3_rpr RPR Receive Pointer Register
@{*/


#define USART3_RPR_RXPTR_SHIFT		0
#define USART3_RPR_RXPTR_MASK		0xffffffff
/** @defgroup usart3_rpr_rxptr RXPTR Receive Pointer Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_rcr RCR Receive Counter Register
@{*/


#define USART3_RCR_RXCTR_SHIFT		0
#define USART3_RCR_RXCTR_MASK		0xffff
/** @defgroup usart3_rcr_rxctr RXCTR Receive Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_tpr TPR Transmit Pointer Register
@{*/


#define USART3_TPR_TXPTR_SHIFT		0
#define USART3_TPR_TXPTR_MASK		0xffffffff
/** @defgroup usart3_tpr_txptr TXPTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_tcr TCR Transmit Counter Register
@{*/


#define USART3_TCR_TXCTR_SHIFT		0
#define USART3_TCR_TXCTR_MASK		0xffff
/** @defgroup usart3_tcr_txctr TXCTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_rnpr RNPR Receive Next Pointer Register
@{*/


#define USART3_RNPR_RXNPTR_SHIFT		0
#define USART3_RNPR_RXNPTR_MASK		0xffffffff
/** @defgroup usart3_rnpr_rxnptr RXNPTR Receive Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_rncr RNCR Receive Next Counter Register
@{*/


#define USART3_RNCR_RXNCTR_SHIFT		0
#define USART3_RNCR_RXNCTR_MASK		0xffff
/** @defgroup usart3_rncr_rxnctr RXNCTR Receive Next Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_tnpr TNPR Transmit Next Pointer Register
@{*/


#define USART3_TNPR_TXNPTR_SHIFT		0
#define USART3_TNPR_TXNPTR_MASK		0xffffffff
/** @defgroup usart3_tnpr_txnptr TXNPTR Transmit Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_tncr TNCR Transmit Next Counter Register
@{*/


#define USART3_TNCR_TXNCTR_SHIFT		0
#define USART3_TNCR_TXNCTR_MASK		0xffff
/** @defgroup usart3_tncr_txnctr TXNCTR Transmit Counter Next
@{*/
/**@}*/


/**@}*/

/** @defgroup usart3_ptcr PTCR Transfer Control Register
@{*/

/** USART3_PTCR_TXTDIS Transmitter Transfer Disable **/
#define USART3_PTCR_TXTDIS		(1 << 9)
/** USART3_PTCR_TXTEN Transmitter Transfer Enable **/
#define USART3_PTCR_TXTEN		(1 << 8)
/** USART3_PTCR_RXTDIS Receiver Transfer Disable **/
#define USART3_PTCR_RXTDIS		(1 << 1)
/** USART3_PTCR_RXTEN Receiver Transfer Enable **/
#define USART3_PTCR_RXTEN		(1 << 0)

/**@}*/

/** @defgroup usart3_ptsr PTSR Transfer Status Register
@{*/

/** USART3_PTSR_TXTEN Transmitter Transfer Enable **/
#define USART3_PTSR_TXTEN		(1 << 8)
/** USART3_PTSR_RXTEN Receiver Transfer Enable **/
#define USART3_PTSR_RXTEN		(1 << 0)

/**@}*/
